Pan-Maciek/STM32Cube-Paint/main.c
  if (s == 0) {
    R = G = B = l;
  } else {
    float q = l < 0.5 ? l * (1 + s) : l + s - l * s;
    float p = 2 * l - q;
    R = hueToRgb(p, q, h + 1 / 3);
    G = hueToRgb(p, q, h);
    B = hueToRgb(p, q, h - 1 / 3);
  }
  return 0xFF000000 | ((r = to255(R)) << 16) | ((g = to255(G)) << 8) | (b = to255(B));
}

void draw_ui() {
  BSP_LCD_SelectLayer(1);

  BSP_LCD_SetTextColor(LCD_COLOR_LIGHTGRAY);
  for (int i = 0; i < 2; i++) {
    BSP_LCD_FillRect(5, i * 25 + 5, 20, 20);
  }

  BSP_LCD_SetTextColor(hslToRgb(h, 100, 50));
  BSP_LCD_FillRect(5, 5 + (0 + 3) * 25, 20, 20);

  BSP_LCD_SetTextColor(hslToRgb(h, s, 50));
  BSP_LCD_FillRect(5, 5 + (1 + 3) * 25, 20, 20);

  BSP_LCD_SetTextColor(hslToRgb(0, 0, l));
  BSP_LCD_FillRect(5, 5 + (2 + 3) * 25, 20, 20);

  BSP_LCD_SetTextColor(hslToRgb(h, s, l));
  BSP_LCD_FillRect(5, 2 * 25 + 5, 20, 20);

  BSP_LCD_SelectLayer(0);
}

int in_range(int min, int max, int val) { return min <= val && val <= max; }

int last_i = -1;
char message[250];
void onTouch(int x, int y) {
  if (in_range(5, 30, x)) {
    int i = (y - 5) / 30;
    xprintf("i: %d\n", i);
    if (i == 0)
      R++;
    else if (i == 1)
      R = max(3, R - 1);
    else if (i == 2 && last_i != 2) {
      netconn_write(conn, "c\n", 2, NETCONN_NOCOPY);
    } else {
      if (i == 3) {
        h = (h + 1) % 360;
      } else if (i == 4) {
        s = (s + 1) % 100;
      } else if (i == 5) {
        l = (l + 1) % 100;
      }
      draw_ui();
    }
    last_i = i;
  } else {
    sprintf(message, "d %i %i %i %i %i %i\n", r, g, b, R, x, y);
    int size = strlen(message);
    netconn_write(conn, message, size, NETCONN_NOCOPY);
  }
}

#define AUDIO_OUT_BUFFER_SIZE 8192
enum {
  BUFFER_OFFSET_NONE = 0,
  BUFFER_OFFSET_HALF,
  BUFFER_OFFSET_FULL,
};

extern ApplicationTypeDef Appli_state;
static uint8_t buf_offs = BUFFER_OFFSET_NONE;

void BSP_AUDIO_OUT_TransferComplete_CallBack(void) {
  buf_offs = BUFFER_OFFSET_FULL;
}

void BSP_AUDIO_OUT_HalfTransfer_CallBack(void) {
  buf_offs = BUFFER_OFFSET_HALF;
}

void StartDefaultTask(void const *argument) {

  MX_LWIP_Init(); // initialize lwip

  osThreadDef(netconn_thread, netconn_thread, osPriorityNormal, 0, 1024); // define network thread
  netconn_thread_handle = osThreadCreate(osThread(netconn_thread), NULL); // start network thread

  lcd_start(); // initialize lcd

  BSP_LCD_SelectLayer(0); //
  BSP_LCD_SetTextColor(LCD_COLOR_GREEN);

  static TS_StateTypeDef TS_State;
  while (connected == 0) { // wait for connection
    vTaskDelay(100);
  }
  draw_ui();

  while (1) {
    BSP_TS_GetState(&TS_State);
    for (int i = 0; i < TS_State.touchDetected; i++) {
      onTouch(TS_State.touchX[i], TS_State.touchY[i]);
    }
    vTaskDelay(10);
  }
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
}

void _Error_Handler(char *file, int line) {
  while (1) {
  }
}

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line) {}
#endif